/**************************************************************************************
实验名称：	外部中断0实验
实验现象：	按下K3键时，可通过外部中断来控制D1指示灯亮灭
实验单片机：普中A2			
注意事项：	将红外接收传感器取下，防止对P3.2口干扰																	  
***************************************************************************************/

#include "public.h"
#include  "led.h"

/*
	函数名： time0_Init
	功能：	 定时器0中断配置函数，通过设置TH和TL可确定定时时间
*/
void time0_Init(void)
{
	TMOD |= 0X01;		//选择为定时器0模式，工作方式1
	TH0 = 0XFC;			//给定时器赋初值，定时1ms
	TL0 = 0X18;	
	ET0 = 1;			//打开定时器0中断允许
	EA = 1;				//打开总中断
	TR0 = 1;			//打开定时器		
}



int main(void)
{
	time0_Init();	//定时器0中断配置
					
	while(1)
	{
		
	}
}


/*
	//定时器0中断函数	
*/
void time0() interrupt 1 
{
	static uint_16 count = 0;	//定义静态变量count
	TH0 = 0XFC;				//重新赋初值，定时1ms
	TL0=0X18;
	count++;
	if(count == 1000)
	{
		count = 0;
		LED1 = !LED1;	
	}						
}



