/**************************************************************************************
实验名称：	独立按键实验
实验现象：	使用独立按键K1键来控制D1指示灯亮灭
实验单片机：普中A2																				  
***************************************************************************************/

#include "public.h"
#include  "key.h"
#include  "led.h"

int main(void)
{	
	uint_8 key_value = 0;
	
	LED1 = 1;	//灯初始灭	
	while(1)
	{
		key_value = Key_Scan(KEY_SCAN_MODE); //扫描模式：单次扫描
		if(key_value==KEY1_PRESS)   //检测按键K1是否按下
			LED1 = !LED1;//LED1状态翻转	
	}
}